Revit 2026 API

# ApplicationNewFamilySymbolProfile Method

---

Creates a new FamilySymbolProfile object.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilySymbolProfile NewFamilySymbolProfile(
	FamilySymbol familySymbol
)
```
```vb
Public Function NewFamilySymbolProfile (
	familySymbol As FamilySymbol
) As FamilySymbolProfile
```
```cpp
public:
FamilySymbolProfile^ NewFamilySymbolProfile(
	FamilySymbol^ familySymbol
)
```
```fsharp
member NewFamilySymbolProfile :
        familySymbol : FamilySymbol -> FamilySymbolProfile
```

#### Parameters

familySymbol FamilySymbol
    The family symbol of the Profile.

#### Return Value

FamilySymbolProfileThe new FamilySymbolProfile object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the argument familySymbol is . |

#### Reference

Application Class

Autodesk.Revit.Creation Namespace